## Анализ набора данных с использованием `pandas` (2)

In [30]:
import pandas as pd
import numpy as np
df = pd.read_csv('Employee.csv')

In [33]:
df.head()

,Education,JoiningYear,City,PaymentTier,Age,Gender,EverBenched,ExperienceInCurrentDomain,LeaveOrNot
0,Bachelors,2017,Bangalore,3,34,Male,No,0,0
1,Bachelors,2013,Pune,1,28,Female,No,3,1
2,Bachelors,2014,New Delhi,3,38,Female,No,2,0
3,Masters,2016,Bangalore,3,27,Male,No,5,1
4,Masters,2017,Pune,3,24,Male,Yes,2,1

Постройте сводную таблицу, показывающую средний возраст сотрудников в каждом городе.

In [28]:
df.groupby("City")["Age"].mean()

City
Bangalore    29.594255
New Delhi    29.121003
Pune         29.288644
Name: Age, dtype: float64

In [31]:
df.pivot_table(values='Age', index='City', aggfunc=np.mean)

                 Age
City
Bangalore  29.594255
New Delhi  29.121003
Pune       29.288644

Рассчитайте количество сотрудников по каждому уровню образования и их средний возраст.

In [34]:
df.groupby("Education").agg({"Age" : "mean", "Education" : "count"})

                 Age  Education
Education
Bachelors  29.422938       3601
Masters    29.290951        873
PHD        29.296089        179

Создайте сводную таблицу, показывающую количество мужчин и женщин в каждом уровне оплаты (Payment Tier).

In [37]:
df.groupby(["PaymentTier", "Gender"]).size().unstack()

Gender       Female  Male
PaymentTier
1               131   112
2               605   313
3              1139  2353

Составьте сводную таблицу, отражающую процент сотрудников, покинувших компанию в следующие два года, в зависимости от того, были ли они когда-либо исключены из проектов на месяц или более.

In [38]:
df.groupby("EverBenched")["LeaveOrNot"].mean()*100

EverBenched
No     33.125749
Yes    45.397490
Name: LeaveOrNot, dtype: float64

Постройте сводную таблицу, отображающую медианный опыт работы в текущей области в зависимости от уровня образования и пола сотрудников.

In [39]:
df.pivot_table(index="Education", columns="Gender", values="ExperienceInCurrentDomain", aggfunc="median")

Gender     Female  Male
Education
Bachelors       3     3
Masters         2     3
PHD             3     3

Рассчитайте количество сотрудников по каждому году присоединения к компании и их средний возраст.

In [43]:
df.groupby("JoiningYear").agg({"Age" : "mean", "JoiningYear": "count"})

                   Age  JoiningYear
JoiningYear
2012         29.603175          504
2013         29.008969          669
2014         29.290415          699
2015         29.476312          781
2016         29.552381          525
2017         29.416968         1108
2018         29.525886          367

Создайте сводную таблицу, показывающую процент сотрудников, покинувших компанию в следующие два года, в зависимости от уровня образования и города, в котором они работают.

In [44]:
df.groupby(["Education", "City"])["LeaveOrNot"].mean()*100

Education  City
Bachelors  Bangalore    24.025341
           New Delhi    18.063315
           Pune         53.260870
Masters    Bangalore    70.161290
           New Delhi    47.001934
           Pune         41.379310
PHD        Bangalore    28.846154
           New Delhi    25.242718
           Pune         16.666667
Name: LeaveOrNot, dtype: float64

Составьте сводную таблицу, отображающую средний возраст сотрудников, которые были когда-либо исключены из проектов, и тех, кто не был, в зависимости от уровня оплаты.

In [45]:
df.groupby(["EverBenched", "PaymentTier"])["Age"].mean()

EverBenched  PaymentTier
No           1              29.644444
             2              29.204848
             3              29.460160
Yes          1              28.944444
             2              28.989247
             3              29.217984
Name: Age, dtype: float64

Постройте сводную таблицу, показывающую средний возраст сотрудников, которые покинули компанию в следующие два года, в зависимости от города и опыта работы в текущей области.

In [46]:
df.pivot_table(index="EverBenched", columns="PaymentTier", values="Age", aggfunc="mean")

PaymentTier          1          2          3
EverBenched
No           29.644444  29.204848  29.460160
Yes          28.944444  28.989247  29.217984

In [47]:
df.groupby(["City", "ExperienceInCurrentDomain"])["Age"].mean()

City       ExperienceInCurrentDomain
Bangalore  0                            31.858757
           1                            31.054795
           2                            29.039823
           3                            28.895141
           4                            28.824834
           5                            29.494481
           6                            35.833333
           7                            38.166667
New Delhi  0                            31.391892
           1                            30.521008
           2                            29.622356
           3                            28.041451
           4                            27.838565
           5                            29.074074
           6                            33.000000
Pune       0                            31.836538
           1                            31.190476
           2                            28.986842
           3                            28.495050
           4                            28.167315
           5                            29.156000
           6                            33.000000
           7                            37.666667
Name: Age, dtype: float64

Создайте сводную таблицу, отображающую процент сотрудников, покинувших компанию в следующие два года, в зависимости от уровня оплаты и того, были ли они когда-либо исключены из проектов на месяц или более.

In [48]:
df.groupby(["PaymentTier", "EverBenched"])["LeaveOrNot"].mean()*100

PaymentTier  EverBenched
1            No             35.555556
             Yes            50.000000
2            No             57.575758
             Yes            80.645161
3            No             26.496000
             Yes            36.239782
Name: LeaveOrNot, dtype: float64

In [50]:
df.pivot_table(index="EverBenched", columns="PaymentTier", values="LeaveOrNot", aggfunc= lambda x: (x.sum()/ x.count())*100)

PaymentTier          1          2          3
EverBenched
No           35.555556  57.575758  26.496000
Yes          50.000000  80.645161  36.239782